import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';

import '../../AppRouter.dart';
import '../ColorUi.dart';

class ConditionsScreen extends StatelessWidget {
   ConditionsScreen({Key? key}) : super(key: key);
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('الشروط والاحكام',style: TextStyle(fontSize: 18.sp),),
        elevation: 0,
        centerTitle: false,
        backgroundColor: Colors.transparent,
        foregroundColor: Colors.black,
      ),
      body:  SingleChildScrollView(
        child: Padding(
          padding: EdgeInsets.all(8.0),
          child: Column(
            children: [
              Text(
                '''
                أهلا بكم في تطبيق "مؤسسة خلطه للمقاولات العامة"، وهي مؤسسة سعودية تأسست وفق "أنظمة المملكة العربية السعودية"، وتقدم العديد من الخدمات المتعلقة في مجال المقاولات العامة.
يرجى منك قراءة هذه الشروط والأحكام بعناية قبل استخدامك لهذا التطبيق، فبمجرد استخدامك له؛ فإن ذلك يعني أنك توافق على اتباع كافة الشروط والأحكام أدناه، وستخضع لأي قواعد وإرشادات تنطبق على كافة خدمات التطبيق، كما يحق لـ "مؤسسة خلطه للمقاولات العامة" التغيير والتعديل في هذه الشروط أو إضافة أو إزالة أحد هذه القواعد والإرشادات في أي وقت كان، لذا نرجو منك زيارة هذه الصفحة بشكل دوري للاطلاع على أحدث الشروط والأحكام، وفي حال عدم موافقتك على الالتزام بهذه الشروط والأحكام والتقيد بها، الرجاء منك عدم استخدام التطبيق.
مصطلحات عامة:
	العميل: أي مستخدم لديه حساب في التطبيق يتيح له "طلب خدمة".
	خدمات: تعني جميع الخدمات التي يُقدمها تطبيق "مؤسسة خلطه"
	المقاول: يقصد به من يقوم بتقديم أعماله الخاصة بمجال المقاولات/البناء للعملاء.
	أطراف أخرى: كافة المؤسسات، الشركات، المهندسين، الأشخاص غير المعرّفين أعلاه.
الشروط والأحكام العامة
	يتعهد العميل بأن يتحلى بالجدية والمصداقية والنزاهة عند تقديم الطلب، واستخدامه أي من خدمات "مؤسسة خلطه للمقاولات العامة"، وعليه فإن لدى المؤسسة الحق في حذف أو حظر حساب العميل واتخاذ الإجراءات القانونية في حال تم اكتشاف عدم مصداقية العميل
	ينبغي على العميل عدم إنشاء أكثر من حساب واحد على التطبيق في أي حال من الأحوال، ولدى المؤسسة الحق في حذف وحظر حساب العميل عند ارتكابه لهذه المخالفة.
	يتعهد المستخدم للتطبيق عدم العبث بالبيانات، والمعلومات، والقرصنة وخلافه محاولة لإفساد أي تدابير أمنية.
	لدى "مؤسسة خلطه للمقاولات العامة" صلاحية في إرسال فريق ميداني لمعاينة المشروع والأعمال التي يطلبها العميل من خلال التطبيق.
	لدى "مؤسسة خلطه للمقاولات العامة" الحق في حذف أي محتوى مخالف لأنظمة وقوانين "المملكة العربية السعودية" أو يسيء للآخرين، ويحق للمؤسسة حظر أو حذف الحساب في حال مخالفته لهذا البند، واتخاذ الإجراءات القانونية وفقاً للأنظمة القانونية في السعودية.
	لدى "مؤسسة خلطه للمقاولات العامة" الحق في حظر أو حذف أي حساب لا يقدم معلومات دقيقة وحديثة، سواء كان عند التسجيل أو عند استخدامه لخدمات التطبيق.
	لدى "مؤسسة خلطه للمقاولات العامة" الحق في حذف أو حجب أي معلومات اتصال أو وسيلة تواصل لمستخدم آخر بغرض الترويج، وعليه فيحق لنا حذف حساب العميل الذي يقوم بتكرار هذه المخالفة لأكثر من مرة.
	يتحمل المستخدم المسؤولية الكاملة للآثار المادية أو القانونية أو المعنوية أو أي من الالتزامات الناتجة عن استخدامه للتطبيق، وعليه لا تتحمل "مؤسسة خلطه للمقاولات العامة" أي من العواقب الناتجة عن استخدامه التطبيق، لذا نرجو منك الحذر والحفاظ على سرية كلمة المرور والتي تسمح لكم بالوصول إلى كافة خدمات التطبيق.
	إن كافة المحتويات المتضمنة داخل التطبيق من معلومات وبيانات، شعارات، تصاميم، عقود، وأي ملكية أخرى هي حقوق محفوظة لدى "مؤسسة خلطه للمقاولات العامة" وهي محمية بموجب القوانين المحلية والأنظمة الدولية، ويمنع استخدامها من قبل المستخدمين أو أي طرف آخر ولأي جهة في أي حال من الأحوال.
	أي معلومة يقدمها المستخدم للتطبيق، عن طريق تصفحه أو استخدامه لخدماتنا تخضع لسياسة الخصوصية الخاصة بالتطبيق، وعليه فإن تصفحك أو استخدامك للتطبيق يعتبر موافقة لحصول واستخدام المؤسسة للمعلومات، كما هو موضح في سياسة الخصوصية.
	نسعى في "مؤسسة خلطه للمقاولات العامة" إلى حماية معلومات وبياناتك بسرية تامة، إلا أن الأمان والحماية على شبكة الانترنت لا يتم بنسبة 100% .
	يحق لنا حذف أي تقييم سلبي في حال لم يتم توضيح السبب.
	لدى "مؤسسة خلطه للمقاولات العامة" حظر أو حذف أي حساب في حال مخالفته لأي شرط من الشروط المذكورة أعلاه، كما تخلي المؤسسة مسؤوليتها من تحمل لأي عبء قانوني/ نظامي جراء ذلك.
	تعتبر كافة الشروط والأحكام قابلة للتعديل، وعليه تكون الشروط والأحكام المحدثة فعالة فور تعديلها، ويحق لـ "مؤسسة خلطه للمقاولات العامة" إرسال اشعار على بريدك الالكتروني لإعلامك بالتعديلات المحدثة.
الشروط والأحكام الخاصة بطلب خدمة
	قد تحتاج لاستخدام حسابك من أجل استخدام خدمات "مؤسسة خلطه للمقاولات العامة" لذا ينبغي عليك تسجيل الدخول وربط وسيلة دفع سارية، وفي حال كانت هناك مشكلة في تحصيل الرسوم من وسيلة الدفع التي قمت بربطها، فقد نقوم بتحصيل المبلغ من أي وسيلة دفع أخرى سارية تكون مربوطة بحسابك.
	يعد الطلب المقدم من طرفك بمثابة عرضاً لـ "مؤسسة خلطه للمقاولات العامة" لطلب الخدمة الواردة في طلبك، فعندما تقوم بإتمام الطلب، سوف نقوم بإرسال رسالة لك عبر البريد الالكتروني تؤكد إتمام عملية التعاقد بينك وبين المؤسسة، وتحتوي على تفاصيل الطلب المقدم (رسالة بريد تأكيد الطلب) وتعد هذه الرسالة إقرار بأننا قمنا باستلام طلبك.
	لدى "مؤسسة خلطه للمقاولات العامة" الحق في وضع تسعيرات مختلفة لكل خدمة من خدمات البناء/ التشطيبات.
	يجب تعبئة العقد إلكترونيا بواسطة العميل لأي خدمة من خدمات "مؤسسة خلطه للمقاولات العامة" عند طلب الخدمة وقبل تنفيذ أعمال المشروع، وهو بمثابة عقد رسمي بين العميل والمؤسسة يخضع لأنظمة "المملكة العربية السعودية".
	لا يحق لأي مستخدم أن يستخدم كافة العقود الموجودة داخل التطبيق بأي شكل كان، إلا بإذن خطي من قبل المهندس "مذكر دغش القحطاني".
	لا تتحمل "مؤسسة خلطه للمقاولات العامة" المسؤولية عن أي خطأ، خسائر مادية بما في ذلك المصاريف المفقودة وغيره من الخسائر غير المباشرة والتي لم تنتج جميعها من طرفنا. 
	لدى "مؤسسة خلطه للمقاولات العامة" الصلاحية في اتخاذ الإجراءات القانونية/النظامية اللازمة، إذا تأخر العميل عن سداد إجمالي قيمة التكاليف المذكورة في لوحة التحكم الخاصة به عن 15 يوماً من التاريخ المتفق عليه في العقد.
	يتم الدفع عن طريق حوالة بنكية بحساب "مؤسسة خلطه للمقاولات العامة"، والالتزام التام بعدم تسليم أي مبلغ مالي عن طريق العمالة داخل المؤسسة، وعليه تُخلي المؤسسة مسؤوليتها القانونية والقضائية حيال أي مطالبة مالية في حال تم تسليم المبلغ للعمالة، ولا يحق لها للطرف الأول المطالبة بأي مبلغ مالي أو أي تعويض.
التعليقات والآراء
بإمكانك نشر التقييمات أو التعليقات أو محتوى آخر، أو تقوم بإرسال أفكار واقتراحات أو أسئلة أو أي معلومات أخرى، إذا لم يكن ذلك غير قانوني أو مسيء أو مهدد أو مشوه للسمعة أو منتهك للخصوصية أو مخالفاً لحقوق الملكية الفكرية أو مضر بأطراف ثالثة أو قابلاً للمعارضة، إضافة لذلك ألا يحتوي على فيروسات برمجيات أو حملات سياسية أو ترويج تجاري أو خطابات متسلسلة أو بريد جماعي أو أي شكل من أشكال "البريد الإلكتروني غير المرغوب به". 

                '''
    ),
              InkWell(
                onTap: (){
                  AppRouter.popFromWidget();
                },
                child: Container(
                  height: 48.h,
                  margin: EdgeInsets.all(10),
                  alignment: Alignment.center,
                  decoration: BoxDecoration(
                    color:  ColorUi.mainColor,
                    borderRadius: BorderRadius.circular(10),
                    boxShadow: const [
                      BoxShadow(
                        color: Color(0x26000000),
                        offset: Offset(0, 3),
                        blurRadius: 15,
                      ),
                    ],
                  ),
                  child: Text('لقد قرأت الشروط',style: TextStyle(fontSize: 18.sp,color: Colors.white),),
                ),
              ),
            ],
          ),

        ),
      ),
    );
  }
}
